using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace _0424.Heap
{
    internal class number2
    {
        /*
         * 힙정렬 기술면접
         * 힙이란 와전 이진 트리의 일종 우선순위 큐를 위하여 만들어진 자료구조 이며
         * 최대값 또는 최소값을 하나씩 꺼내어 정렬한는 알고리즘입니다.
         * 힙의 추가는 추가한 값을 맨 마지막 우선순위에 배치하고 부모 위치와 우선순위를 비교하며 부모보다 우선 순위가 높으면
         * 승격하고 낮다면 그자리에 고정되는 방식입니다.
         * 힙의 삭제는 최우선순위의 값을 삭제하고 그자리에 맨 마지막 순위의 값을 최우선 순위의 위치에 올려 자식위치에 우선순위를 비교해 가며
         * 강등하면서 내려가는 작업을 해준다.
         * 
         * 완전이진트리 배열 표현
         * {    1,      2,      3,      4,      5,      6,      7,      8,      9,       ...} 
         * | 0깊이||  1깊이       ||        2깊이                 |      3깊이                |
         */
    }
}
