using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace _0418.ListClass
{
    internal class number2
    {
        /*
         * 배열 : 동일한 자료형(기본자료형, 구조체, 포인터)들이 <색인, 원소>의 순서쌍으로 집단화한 선형자료구조
         *        하나의 변수에 여러 값을 저장하는 데 쓰이는 정적 리스트 구조. 원소의 갯수가 정해져서 항상 마지막
         *        원소가 존재함 .
         *        색인(index)를 이용해서 자료형이 같은 데이터를 관리 및 집합 내에서 상대적인 위치의 식별(접근)이 가능함
         *        순차적 접근 -> 주소 계산이 쉬움.  임의접근 -> 주소만 있으면 일정 시간 내 접근 가능
         * 선형리스트 : 자료를 구조화 하는 가장 기본적인 방법으로 자료를 나열한 목록 또는 자료간 순서를 갖는 리스트
         *             자료들이 순서대로 연속적인 메모리에 저장되고 원소들의 논리적 순서와 같은 순서로 기억공간에 
         *             저장하고 원소들의 논리적인 순서=원소가 저장된 물리적 순서
         *             특직으로는 삽입, 삭제시 순서의 변형이 없으며 접근속도가 빠르고 알고리즘이 간단하다.
         * 
         */
    }
}
